Repository: Sefaria/Sefaria-Project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, he

source: ambiguous option: %(option)s could match %(matches)s
es: 模糊选项：%(option)s 可能匹配 %(matches)s

source: Error verifying reCAPTCHA, please try again.
es: 验证reCAPTCHA时出错，请重试。

source: Messages
es: 消息

source: Site Maps
es: 网站地图

source: Static Files
es: 静态文件

source: Syndication
es: 联合发布

source: That page number is not an integer
es: 该页码不是整数

source: That page number is less than 1
es: 该页码小于1

source: That page contains no results
es: 该页面没有结果

source: Enter a valid value.
es: 输入有效的值。

source: Enter a valid URL.
es: 输入有效的URL。

source: Enter a valid integer.
es: 输入有效的整数。

source: Enter a valid email address.
es: 输入有效的电子邮件地址。

source: Enter a valid IPv4 address.
es: 输入有效的IPv4地址。

source: Enter a valid IPv6 address.
es: 输入有效的IPv6地址。

source: Enter a valid IPv4 or IPv6 address.
es: 输入有效的IPv4或IPv6地址。

source: Enter only digits separated by commas.
es: 仅输入以逗号分隔的数字。

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
es: 确保此值为 %(limit_value)s（实际为 %(show_value)s）。

source: Ensure this value is less than or equal to %(limit_value)s.
es: 确保此值小于或等于 %(limit_value)s。

source: Ensure this value is greater than or equal to %(limit_value)s.
es: 确保此值大于或等于 %(limit_value)s。

source: and
es: 和

source: %(model_name)s with this %(field_labels)s already exists.
es: 具有此 %(field_labels)s 的 %(model_name)s 已经存在。

source: Value %(value)r is not a valid choice.
es: 值 %(value)r 不是有效的选择。

source: This field cannot be null.
es: 此字段不能为空。

source: This field cannot be blank.
es: 此字段不能为空。

source: %(model_name)s with this %(field_label)s already exists.
es: 具有此 %(field_label)s 的 %(model_name)s 已经存在。

source: Field of type: %(field_type)s
es: 字段类型：%(field_type)s

source: Integer
es: 整数

source: '%(value)s' value must be an integer.
es: '%(value)s' 的值必须是整数。

source: Big (8 byte) integer
es: 大（8字节）整数

source: '%(value)s' value must be either True or False.
es: '%(value)s' 的值必须是 True 或 False。

source: Boolean (Either True or False)
es: 布尔值（True 或 False）

source: String (up to %(max_length)s)
es: 字符串（最多 %(max_length)s）

source: Comma-separated integers
es: 以逗号分隔的整数

source: Date (without time)
es: 日期（不含时间）

source: Date (with time)
es: 日期（含时间）

source: '%(value)s' value must be a decimal number.
es: '%(value)s' 的值必须是小数。

source: Decimal number
es: 小数

source: Duration
es: 持续时间

source: Email address
es: 电子邮件地址

source: File path
es: 文件路径

source: '%(value)s' value must be a float.
es: '%(value)s' 的值必须是浮点数。

source: Floating point number
es: 浮点数

source: IPv4 address
es: IPv4 地址

source: IP address
es: IP 地址

source: '%(value)s' value must be either None, True or False.
es: '%(value)s' 的值必须是 None、True 或 False。

source: Boolean (Either True, False or None)
es: 布尔值（True、False 或 None）

source: Positive integer
es: 正整数

source: Positive small integer
es: 正小整数

source: Slug (up to %(max_length)s)
es: 简短名称（最多 %(max_length)s）

source: Small integer
es: 小整数

source: Text
es: 文本

source: Time
es: 时间

source: URL
es: 网址

source: Raw binary data
es: 原始二进制数据

source: '%(value)s' is not a valid UUID.
es: '%(value)s' 不是有效的 UUID。

source: File
es: 文件

source: Image
es: 图像

source: %(model)s instance with %(field)s %(value)r does not exist.
es: 具有 %(field)s %(value)r 的 %(model)s 实例不存在。

source: Foreign Key (type determined by related field)
es: 外键（由相关字段确定类型）

source: One-to-one relationship
es: 一对一关系

source: %(from)s-%(to)s relationship
es: %(from)s-%(to)s 关系

source: %(from)s-%(to)s relationships
es: %(from)s-%(to)s 关系

source: Many-to-many relationship
es: 多对多关系

source: This field is required.
es: 此字段是必填的。

source: Enter a whole number.
es: 输入一个整数。

source: Enter a number.
es: 输入一个数字。

source: Enter a valid date.
es: 输入有效的日期。

source: Enter a valid time.
es: 输入有效的时间。

source: Enter a valid date/time.
es: 输入有效的日期/时间。

source: Enter a valid duration.
es: 输入有效的持续时间。

source: No file was submitted. Check the encoding type on the form.
es: 没有提交文件。请检查表单上的编码类型。

source: No file was submitted.
es: 没有提交文件。

source: The submitted file is empty.
es: 提交的文件为空。

source: Please either submit a file or check the clear checkbox, not both.
es: 请提交文件或选中清除复选框，而不是两者都做。

source: Select a valid choice. %(value)s is not one of the available choices.
es: 选择一个有效的选项。%(value)s 不是可用选项之一。

source: Enter a list of values.
es: 输入一个值列表。

source: Enter a complete value.
es: 输入完整的值。

source: Enter a valid UUID.
es: 输入有效的 UUID。

source: (Hidden field %(name)s) %(error)s
es: (隐藏字段 %(name)s) %(error)s

source: ManagementForm data is missing or has been tampered with
es: ManagementForm 数据丢失或已被篡改

source: Order
es: 排序

source: Delete
es: 删除

source: Please correct the duplicate data for %(field)s.
es: 请更正 %(field)s 的重复数据。

source: Please correct the duplicate data for %(field)s, which must be unique.
es: 请更正 %(field)s 的重复数据，该数据必须唯一。

source: Please correct the duplicate values below.
es: 请更正下面的重复值。

source: The inline foreign key did not match the parent instance primary key.
es: 内联外键与父实例主键不匹配。

source: Select a valid choice. That choice is not one of the available choices.
es: 选择一个有效的选项。该选项不是可用选项之一。

source: Clear
es: 清除

source: Currently
es: 当前

source: Change
es: 更改

source: Unknown
es: 未知

source: Yes
es: 是

source: No
es: 否

source: yes,no,maybe
es: 是，否，也许

source: p.m.
es: 下午

source: a.m.
es: 上午

source: PM
es: 下午

source: AM
es: 上午

source: midnight
es: 午夜

source: noon
es: 中午

source: Monday
es: 星期一

source: Tuesday
es: 星期二

source: Wednesday
es: 星期三

source: Thursday
es: 星期四

source: Friday
es: 星期五

source: Saturday
es: 星期六

source: Sunday
es: 星期日

source: Mon
es: 周一

source: Tue
es: 周二

source: Wed
es: 周三

source: Thu
es: 周四

source: Fri
es: 周五

source: Sat
es: 周六

source: Sun
es: 周日

source: January
es: 一月

source: February
es: 二月

source: March
es: 三月

source: April
es: 四月

source: May
es: 五月

source: June
es: 六月

source: July
es: 七月

source: August
es: 八月

source: September
es: 九月

source: October
es: 十月

source: November
es: 十一月

source: December
es: 十二月

source: jan
es: 一月

source: feb
es: 二月

source: mar
es: 三月

source: apr
es: 四月

source: may
es: 五月

source: jun
es: 六月

source: jul
es: 七月

source: aug
es: 八月

source: sep
es: 九月

source: oct
es: 十月

source: nov
es: 十一月

source: dec
es: 十二月

# abbrev. month
source: Jan.
es: 1月

# abbrev. month
source: Feb.
es: 2月

# abbrev. month
source: March
es: 三月

# abbrev. month
source: April
es: 四月

# abbrev. month
source: May
es: 五月

# abbrev. month
source: June
es: 六月

# abbrev. month
source: July
es: 七月

# abbrev. month
source: Aug.
es: 8月

# abbrev. month
source: Sept.
es: 9月

# abbrev. month
source: Oct.
es: 10月

# abbrev. month
source: Nov.
es: 11月

# abbrev. month
source: Dec.
es: 12月

# alt. month
source: January
es: 一月

# alt. month
source: February
es: 二月

# alt. month
source: March
es: 三月

# alt. month
source: April
es: 四月

# alt. month
source: May
es: 五月

# alt. month
source: June
es: 六月

# alt. month
source: July
es: 七月

# alt. month
source: August
es: 八月

# alt. month
source: September
es: 九月

# alt. month
source: October
es: 十月

# alt. month
source: November
es: 十一月

# alt. month
source: December
es: 十二月

source: This is not a valid IPv6 address.
es: 这不是有效的IPv6地址。

source: or
es: 或

source: 0 minutes
es: 0 分钟

source: Forbidden
es: 禁止

source: CSRF verification failed. Request aborted.
es: CSRF验证失败。请求被中止。

source: More information is available with DEBUG=True.
es: 更多信息请设置DEBUG=True。

source: Welcome to Django
es: 欢迎来到Django

source: It worked!
es: 成功了！

source: Congratulations on your first Django-powered page.
es: 祝贺你创建了第一个Django页面。

source: No year specified
es: 未指定年份

source: Date out of range
es: 日期超出范围

source: No month specified
es: 未指定月份

source: No day specified
es: 未指定日期

source: No week specified
es: 未指定周

source: No %(verbose_name_plural)s available
es: 没有可用的%(verbose_name_plural)s

source: Invalid date string '%(datestr)s' given format '%(format)s'
es: 无效的日期字符串 '%(datestr)s'，格式 '%(format)s'

source: No %(verbose_name)s found matching the query
es: 没有找到匹配查询的%(verbose_name)s

source: Page is not 'last', nor can it be converted to an int.
es: 页面不是'最后'，也不能转换为整数。

source: Invalid page (%(page_number)s): %(message)s
es: 无效的页面 (%(page_number)s): %(message)s

source: Empty list and '%(class_name)s.allow_empty' is False.
es: 空列表且 '%(class_name)s.allow_empty' 为 False。

source: Directory indexes are not allowed here.
es: 这里不允许目录索引。

source: Index of %(directory)s
es: %(directory)s 的索引

source: Personal info
es: 个人信息

source: Permissions
es: 权限

source: Important dates
es: 重要日期

source: Groups
es: 群组

source: Please enter a correct email and password.
es: 请输入正确的电子邮件和密码。

source: You do not have permission to access the admin.
es: 你没有权限访问管理员。

source: This account is inactive.
es: 此账户已被停用。

source: Email
es: 电子邮件

source: A user with that email already exists.
es: 该电子邮件的用户已存在。
he: משתמש עם כתובת הדוא״ל לעיל כבר קיים

source: Enter a valid e-mail address.
es: 请输入有效的电子邮件地址。

source: Email:
es: 电子邮件：

source: Password:
es: 密码：

source: Forgotten your password or username?
es: 忘记了密码或用户名？

source: Log in
es: 登录

source: Content purported to be compressed with %s but failed to decompress.
es: 内容声称使用 %s 压缩，但解压失败。

source: Unsupported value for qop: %s.
es: 不支持的 qop 值: %s。

source: Unsupported value for algorithm: %s.
es: 不支持的算法值: %s。

source: The challenge doesn't contain a server nonce, or this one is empty.
es: 挑战中不包含服务器 nonce，或者该 nonce 为空。

source: Unsupported value for pw-algorithm: %s.
es: 不支持的 pw-algorithm 值: %s。

source: Redirected but the response is missing a Location: header.
es: 重定向，但响应中缺少 Location: 头。

source: ipware app
es: ipware 应用

source: English
es: 英语
he: אנגלית

source: Hebrew
es: 希伯来语
he: עברית

source: Bilingual
es: 双语
he: דו לשוני

source: Read the text of %(book)s online with commentaries and connections.
es: %(book)s 的文本可以在线阅读，附有注释和关联。
he: %(book)s מקוון בליווי מפרשים וקשרים לטקסטים אחרים

source: Explore 3,000 years of Jewish texts in Hebrew and English translation.
es: 探索三千年的犹太文本，包括希伯来语和英文翻译。
he: צאו למסע בעקבות 3000 שנה של טקסטים יהודיים, בעברית ובתרגום לאנגלית

source: A source sheet created with Sefaria's Source Sheet Builder
es: 使用 Sefaria 的源表生成器创建的源表
he: דף מקורות בנוי בעזרת מחולל דפי המקורות של ספריא

source: Recently Viewed
es: 最近查看
he: נצפו לאחרונה

source: Texts that you've recently viewed on Sefaria.
es: 您最近在 Sefaria 上查看的文本。
he: ספרים שנצפו לאחרונה בספריא

source: Read %(categories)s texts online with commentaries and connections.
es: 在线阅读 %(categories)s 文本，附有注释和关联。
he: ספרי %(categories)s מקוונים

source: Explore Jewish Texts by Topic
es: 按主题探索犹太文本
he: עיון בארון הספרים היהודי לפי נושא

source: Sefaria Search
es: Sefaria 搜索
he: חיפוש בספריא

source: Search 3,000 years of Jewish texts in Hebrew and English translation.
es: 搜索三千年的犹太文本，包括希伯来语和英文翻译。
he: חפשו בין אוצר המקורות הכולל 3000 שנה של כתבים יהודיים. בעברית ובתרגום לאנגלית.

source: Sefaria Collections
es: Sefaria 收藏
he: האסופות של ספריא

source: Pecha - Buddhism in your own words
es: Pecha - 用你自己的话说佛教

source: Learning Schedules
es: 学习计划

source: My Saved Content
es: 我的保存内容
he: התוכן השמור שלי

source: See your saved content on Sefaria
es: 查看您在 Sefaria 上保存的内容
he: צפייה במקורות ודפים שמורים בספריא

source: My User History
es: 我的用户历史
he: היסטורית קריאה שלי

source: See your user history on Sefaria
es: 查看您在 Sefaria 上的用户历史
he: צפייה בהיסטורית הגלישה בספריא

source: User Stats
es: 用户统计
he: סטטיסטיקות משתמשים

source: Sefaria Notifications
es: Sefaria 通知
he: הודעות בספריא

source: Moderator Tools
es: 主持工具
he: כלי מנהלים

source: Topics
es: 主题
he: נושאים

source: Source Sheet
es: 源表
he: דף מקורות

source: Texts
es: 文本
he: טקסטים

source: Explore Jewish Texts by Topic on Sefaria
es: 在 Sefaria 上按主题探索犹太文本
he: מקורות לפי נושא בספריא

source: %(full_name)s on Sefaria
es: %(full_name)s 在 Sefaria 上
he: %(full_name)s בספריא

source: You must be logged in to update your profile.
es: 您必须登录才能更新您的个人资料。
he: הנכם צריכים להיות מחוברים כדי לערוך את הפרופיל שלכם.

source: Email fields did not match
es: 电子邮件字段不匹配
he: כתובות הדוא״ל אינן תואמות

source: Incorrect account password for this account
es: 此账户的密码不正确
he: סיסמא לא נכונה לשם המשתמש הזה

source: You must be logged in to update your profile photo.
es: 您必须登录才能更新您的个人资料照片。
he: הנכם צריכים להיות מחוברים כדי לערוך את תמונת הפרופיל שלכם.

source: You must be logged in to delete your account.
es: 您必须登录才能删除您的账户。

source: From the Community: Today on Sefaria
es: 来自社区：今天在 Sefaria 上
he: מן הקהילה: היום בספריא

source: Email Address to delete
es: 要删除的电子邮件地址

source: Admin Password
es: 管理员密码

source: Sheet ID to delete
es: 要删除的表单 ID

source: Email Address
es: 电子邮件地址
he: כתובת דוא״ל

source: Password
es: 密码
he: סיסמא

source: First Name
es: 名
he: שם פרטי

source: Last Name
es: 姓
he: שם משפחה

source: Incorrect mobile_app_key provided
es: 提供的 mobile_app_key 不正确
he: מפתח איות נייד לא תקין

source: New password
es: 新密码
he: סיסמא חדשה

source: Enter New Password
es: 输入新密码
he: בחרו סיסמא חדשה

source: New password confirmation
es: 新密码确认
he: אימות סיסמא חדשה

source: Repeat New Password
es: 重复新密码
he: הקלידו שוב סיסמא חדשה

source: Please set a name for your collection.
es: 请为您的收藏设置一个名称。
he: יש לבחור שם לאסופה.

source: Public Collections are required to have at least 3 public sheets.
es: 公共收藏要求至少有 3 张公开的表单。
he: כדי לפרסם אסופה ציבורית, יש לכלול בה לפחות שלושה דפי מקורות פתוחים לציבור.

source: %(name)s invited you to a collection on Sefaria
es: %(name)s 邀请您加入 Sefaria 的收藏
he: קיבלת הזמנה מ%(name)s לאסופה באתר ספריא

source: A user with that email already exists
es: 该电子邮件的用户已存在
he: משתמש עם כתובת הדוא״ל לעיל כבר קיים

source: The email address is not valid.
es: 电子邮件地址无效。
he: כתובת הדוא״ל הזו אינה תקינה

source: Sorry, there was an error.
es: 对不起，发生了一个错误。
he: סליחה, אירעה שגיאה.

source: You must be logged in to create a new collection.
es: 您必须登录才能创建新的收藏。
he: כדי ליצור אסופה חדשה, יש להתחבר עם שם משתמש וסיסמה.

source: You must be logged in to access this api.
es: 您必须登录才能访问此 API。
he: הנכם צריכים להיות מחוברים כדי להשתמש באפשרות זו.

source: Page Not Found | Sefaria
es: 页面未找到 | Sefaria
he: הדף שביקשתם איננו נמצא | ספריא

source: Page Not Found
es: 页面未找到

source: Internal Server Error
es: 内部服务器错误
he: שגיאת מערכת

source: development team
es: 开发团队

source: Account Settings
es: 账户设置

source: Cancel
es: 取消
he: ביטול

source: Save
es: 保存

source: Notification Frequency (Maximum)
es: 通知频率（最大）

source: Daily
es: 每日

source: Weekly
es: 每周

source: Never
es: 从不

source: Site Language
es: 网站语言

source: english
es: 英语

source: tibetan
es: 藏语

source: Preferred Translation Language
es: 首选翻译语言

source: Reading History
es: 阅读历史

source: On
es: 开启

source: Off
es: 关闭

source: Account Email (This is used for login)
es: 账户电子邮件（用于登录）

source: Change Email
es: 更改电子邮件

source: New Email
es: 新电子邮件
he: כתובת דוא״ל חדשה

source: Confirm New Email
es: 确认新电子邮件
he: וידוא כתובת מייל חדשה

source: Update Email
es: 更新电子邮件

source: Google Account (Allows for exporting sheets to Google Drive)
es: Google 账户（允许将表单导出到 Google Drive）

source: Disconnect
es: 断开连接

source: Your Google Account has been disconnected
es: 您的 Google 账户已被断开

source: You can link to a new Google Account the next time you export a sheet
es: 下次导出表单时，您可以链接到新的 Google 账户

source: Revision History of
es: 修订历史
he: היסטורית עריכה של

source: Sefaria Activity
es: Sefaria 活动
he: פעילות בספריא

source: View the complete revision hisotry of this text on Sefaria.
es: 查看此文本在 Sefaria 上的完整修订历史。
he: צפו בהיסטורית העריכה של הטקסט הזה בספריא

source: Public Activity
es: 公共活动

source: Recent Activity on Sefaria
es: Sefaria 上的最新活动

source: All Activity
es: 所有活动
he: היסטוריית פעילות

source: Translations
es: 翻译
he: תרגומים

source: Source Sheets
es: 源表
he: דפי מקורות

source: New Texts
es: 新文本
he: טקסטים חדשים

source: Edits
es: 编辑
he: עריכות

source: Notes
es: 笔记
he: הערות

source: Reviews
es: 评论
he: ביקורות גולשים

source: Text Info
es: 文本信息
he: מידע אודות הטקסט

source: Reversions
es: 恢复
he: שחזורים

source: Flagged
es: 标记
he: מסומנים

source: Admin: Delete a Sheet
es: 管理员：删除一个表单

source: Delete Sheet
es: 删除表单

source: CAUTION THIS WILL DELETE THE SHEET ID YOU INPUT
es: 注意，这将删除您输入的表单 ID

source: IT CANNOT BE UNDONE.
es: 此操作无法撤销。

source: Discuss a Text on Sefaria
es: 在 Sefaria 上讨论文本

source: This is an <b>EXPERIMENTAL
es: 这是一个 <b>实验性的

source: feature. Please try it out and let us know what is
es: 功能。请试用并告诉我们

source: exciting
es: 令人兴奋的

source: and what is
es: 以及

source: frustrating
es: 令人沮丧的

source: about it!
es: 点！

source: Choose a Text
es: 选择一个文本

source: Start a Discussion
es: 开始讨论

source: Anyone with the link below will be able to view and participate.
es: 任何拥有下面链接的人都可以查看和参与。

source: Get Started
es: 开始

source: Your Discussions
es: 您的讨论

source: Edit Collection on Sefaria
es: 编辑 Sefaria 上的收藏
he: עריכת עריכת בספריא

source: Loading...
es: 加载中...
he: טוען...

source: Edit Your Profile on Sefaria
es: 编辑您的 Sefaria 个人资料
he: עריכת פרטי פרופיל

source: Edit Your Profile
es: 编辑您的个人资料

source: Title
es: 标题

source: Organization
es: 组织

source: Website
es: 网站

source: Location
es: 地点

source: Education
es: 教育

source: where have you learned
es: 您在哪里学习过

source: Add a line
es: 添加一行

source: About Me
es: 关于我

source: Public Sheets
es: 公开表单

source: Pinned Sheets
es: 固定表单

source: All Sheets
es: 所有表单

source: Contact
es: 联系方式

source: Email (will be public)
es: 电子邮件（将公开）

source: Profile URL
es: 个人资料 URL

source: Twitter Handle
es: Twitter 账号

source: YouTube Channel
es: YouTube 频道

source: Terms Editor
es: 条款编辑器

source: Add a New Text
es: 添加新文本

source: Text or commentator name:
es: 文本或评论者姓名：

source: Add
es: 添加
he: הוספה

source: Your Review:
es: 您的评论：

source: How should I write a review?
es: 我该如何写评论？

source: To add your review, please
es: 要添加您的评论，请

source: log in
es: 登录

source: register
es: 注册

source: Close
es: 关闭

source: Writing Helpful Reviews
es: 撰写有用的评论

source: For primary texts and historical translations:
es: 对于主要文本和历史翻译：

source: I compared this text to X printed edition and found no problems.
es: 我将此文本与 X 印刷版进行比较，未发现问题。

source: I checked this text against the edition on X website, all looks good.
es: 我将此文本与 X 网站上的版本进行对比，一切正常。

source: I read this text carefully and don't see anything wrong.
es: 我仔细阅读了此文本，没有发现任何问题。

source: For original translations:
es: 对于原始翻译：

source: translation guidelines
es: 翻译指南

source: This translation seems accurate to me.
es: 这翻译在我看来很准确。

source: The language could be improved, but the translation seems right.
es: 语言可以改进，但翻译似乎是正确的。

source: This translation misunderstands the term X.
es: 这翻译误解了术语 X。

source: How to Score your Review:
es: 如何评分您的评论：

source: Compared to a source, didn't notice any problems.
es: 与源文进行比较，未发现问题。

source: Looks problem free, but could be reviewed more closely.
es: 看起来没有问题，但可以更仔细审查。

source: Found some issues that need to be addressed.
es: 发现一些需要解决的问题。

source: Found serious problems that need to be addressed.
es: 发现了需要解决的严重问题。

source: OK
es: 确定

source: Source
es: 来源

source: Original Translation
es: 原始翻译

source: Copied Text
es: 复制的文本

source: This text will be published with a
es: 这文本将以

source: Copied texts must either be in the
es: 复制的文本必须在

source: Public Domain
es: 公有领域

source: or carry a
es: 或带有

source: Creative Commons
es: 知识共享

source: license such as
es: 许可，例如

source: summary of Copyright Terms
es: 版权条款摘要

source: Version Title:
es: 版本标题：

source: Copied from:
es: 复制自：

source: deleted the text
es: 删除了文本
he: מחק את הטקסט

source: deleted a text version of
es: 删除了一个文本版本
he: מחק את גרסת הטקסט של

source: Version
es: 版本
he: גרסה

source: translated
es: 翻译
he: תורגם

source: added
es: 添加
he: נוסף

source: edited
es: 编辑
he: נערך

source: reverted
es: 恢复
he: שוחזר

source: and
es: 和
he: ו

source: others
es: 其他
he: אחרים

source: history
es: 历史
he: הסטוריה

source: added a connection
es: 添加了一个连接
he: קישור לטקסט אחר

source: edited a connection
es: 编辑了一个连接
he: ערך קישור

source: deleted a connection
es: 删除了一个连接
he: מחק קישור

source: between
es: 之间
he: בין

source: automatic commentary link
es: 自动注释链接
he: קישור אוטומטי לפירוש

source: automatic citation link
es: 自动引用链接
he: קישור אוטומטי לציטוט

source: added a note to
es: 添加了一个注释到
he: הוסיף הערה ל

source: edited a note on
es: 编辑了一个注释在
he: ערך הערה ב

source: deleted a note on
es: 删除了一个注释在
he: מחק הערה ב

source: added text info for the text
es: 为文本添加了文本信息
he: הוסיף מידע אודות הטקסט

source: edited the text info of
es: 编辑了文本信息
he: ערך מידע אודות הטקסט

source: details
es: 详细信息
he: פרטים

source: added a term
es: 添加了一个术语
he: הוסיף מונח

source: edited the term
es: 编辑了术语
he: ערך את המונח

source: deleted the term
es: 删除了术语
he: מחק את המונח

source: reviewed
es: 已审阅
he: בחן שינויים בטקסט

source: published a new Source Sheet
es: 发布了新的来源表
he: פרסם דף מקורות חדש

source: related
es: 相关
he: נוספים

source: No matching public activity yet.
es: 尚无匹配的公开活动。
he: לא נמצאו פרטי פעילות גלויה תואמים

source: No public activity yet.
es: 尚无公开活动。
he: לא נמצאה פעילות גלויה

source: No matching public history items.
es: 没有匹配的公开历史项目。
he: לא נמצאו פרטי הסטוריה גלויה תואמים

source: No public history items.
es: 没有公开历史项目。
he: לא נמצאו פרטי הסטוריה גלויה

source: Older Activity
es: 较早的活动
he: פעילות ישנה

source: Sign Up
es: 注册

source: New
es: 新

source: version of
es: 版本

source: New Text:
es: 新文本：

source: likes your sheet,
es: 喜欢你的表格，

source: published a new sheet
es: 发布了新表格

source: is now following you.
es: 现在关注你。

source: added you to the collection
es: 将你添加到收藏中
he: הוסיפו אתכם לאסופה

source: added a note to a
es: 在某个
he: הוסיפו הערה ל

source: discussion you follow
es: 讨论中添加了注释
he: דיון אחריו אתם עוקבים

source: sent you a message:
es: 给你发了消息：
he: שלח לך הודעה

source: Reply to
es: 回复
he: השיבו ל

source: likes your Source Sheet
es: 喜欢你的来源表
he: אהבו את דף המקורות שלכם

source: is now following you
es: 现在关注你
he: עוקבים אחריכם

source: This is a notification without a type, it shouldn't exist.
es: 这是一个没有类型的通知，它不应该存在。
he: זוהי הודעה ללא תוכן, היא לא צריכה להתקיים.

source: Hello %(recipient)s,
es: 你好 %(recipient)s，
he: שלום %(recipient)s,

source: Here's some new activity on Sefaria that you may have missed.
es: 这是你可能错过的一些Sefaria的新活动。
he: להלן מעט מהעדכונים האחרונים שיתכן ופספסת בספריא

source: Top Contributors | Sefaria
es: 顶级贡献者 | Sefaria
he: מוסיפי טקסט מצטיינים

source: Top Contributors
es: 顶级贡献者

source: Sefaria Metrics
es: Sefaria 统计数据
he: סטטיסטיקות בספריא

source: Metrics
es: 统计数据

source: Total Words in Library
es: 图书馆中的总字数
he: מספר מילים כולל בספרייה

source: Words in Hebrew & Aramaic
es: 希伯来语和亚拉姆语中的字数
he: מספר מילים בעברית ובארמית

source: Words in Translation
es: 翻译中的字数
he: מספר מילים מתורגמות

source: Words of Original Translation created by Sefaria Volunteers
es: 由Sefaria志愿者创建的原始翻译的字数
he: מספר מילים בתרגומים מקוריים על ידי משתמשי ספריא

source: Number of Public Contributors
es: 公共贡献者数量
he: מספר משתמשים שתרמו טקסט

source: Number of Intertextual Links
es: 文本之间链接的数量
he: מספר קשרים אינטרטקסטואליים

source: Number of Source Sheets
es: 来源表的数量
he: מספר דפי המקורות בספריא

source: Words
es: 字数
he: מילים

source: Contributors
es: 贡献者
he: תורמים

source: Links
es: 链接
he: קשרים

source: Authors on Sefaria
es: Sefaria上的作者
he: חכמים, מחברים והוגים בספריא

source: Authors
es: 作者
he: מחברים

source: People in the Talmud
es: 塔木德中的人物
he: אישים בתלמוד

source: Learn More
es: 了解更多

source: Wikipedia
es: 维基百科

source: Wikipedia (Hebrew)
es: 维基百科（希伯来语）

source: Jewish Encyclopedia
es: 犹太百科全书

source: Works
es: 作品

source: Map
es: 地图

source: on Sefaria
es: 在Sefaria上
he: בספריא

source: at
es: 在
he: ב

source: Twitter
es: 推特

source: Message
es: 消息

source: Follow
es: 关注

source: Following
es: 正在关注

source: Unfollow
es: 取消关注

source: Edit Profile
es: 编辑个人资料

source: Activity
es: 活动
he: פעילות

source: More Activity
es: 更多活动
he: עוד פעילות

source: Send a message to
es: 向发送消息
he: שלחו הודעה ל

source: Send
es: 发送
he: שליחה

source: Random Text | Sefaria.org
es: 随机文本 | Sefaria.org

source: A Random Text on Sefaria
es: Sefaria上的随机文本

source: Get Random
es: 获取随机文本

source: Admin: Delete a User
es: 管理员：删除用户
