Repository: Sefaria/Sefaria-Project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, he

source: Delete User
es: 删除用户

source: Logged Out | Sefaria
es: 已注销 | Sefaria
he: מנותק | ספריא

source: You are now logged out.
es: 你现在已注销。

source: Log back in
es: 重新登录

source: Log in to Pecha
es: 登录Pecha

source: You are already logged in as
es: 你已经以身份登录

source: Logout.
es: 注销。

source: Your username and password didn't match. Please try again.
es: 你的用户名和密码不匹配。请再试一次。

source: Login
es: 登录

source: Forgot your password?
es: 忘记密码？

source: Create a new account
es: 创建一个新账户

source: Password Reset
es: 密码重置
he: איפוס סיסמא

source: Your new password has been saved.
es: 你的新密码已保存。

source: Back to login
es: 返回登录

source: Choose a new Password
es: 选择一个新密码
he: בחרו סיסמא חדשה

source: Choose a new password
es: 选择新密码

source: Save Password
es: 保存密码

source: Password Reset Link Sent
es: 密码重置链接已发送
he: קישור לאיפוס סיסמא נשלח

source: An email has been sent with a link to reset your password.
es: 一封电子邮件已发送，其中包含重置密码的链接。

source: Click this link, or copy it to your browser, to choose a new password:
es: 点击此链接，或将其复制到浏览器中，选择新密码：
he: לחצו כאן, או העתיקו והדביקו את הכתובת לדפדפן שלכם בכדי לבחור ססמה חדשה:

source: If you did not request this reset, you can safely ignore this email.
es: 如果你没有请求此重置，可以安全地忽略这封邮件。
he: אם לא שלחתם בקשה לאיפוס סיסמא, הנכם מוזמנים להתעלם מהמייל הזה

source: Forgot your Password
es: 忘记密码
he: שכחתי את הסיסמא שלי

source: Request a link to change your Sefaria password if you've forgotten it.
es: 如果你忘记了Sefaria密码，请请求一个链接来更改密码。
he: שכחתם סיסמא? ספריא יכולה לשלוח קישור לאיפוס סיסמת החשבון שלכם.

source: Forgot Your Password
es: 忘记密码

source: Send Reset Link
es: 发送重置链接

source: Pecha.org Password Reset
es: Pecha.org 密码重置

source: Create an Account
es: 创建账户
he: יצירת חשבון

source: Already have an account? Log in
es: 已经有账户？登录

source: Sefer HaChinukh Visualization
es: Sefer HaChinukh 可视化
he: תרשימים גרפיים מספר החינוך

source: Start a New Sheet - Sefaria Source Sheet Builder
es: 开始一个新的表格 - Sefaria 来源表生成器
he: יצירת דף מקורות חדש - בונה דפי המקורות של ספריא

source: A source sheet created with Sefaria's Source Sheet Builder.
es: 使用Sefaria的来源表生成器创建的来源表。
he: דף מקורות בנוי בעזרת מחולל דפי המקורות של ספריא

source: Create your own source sheet with Sefaria's Source Sheet Builder.
es: 使用Sefaria的来源表生成器创建你自己的来源表。
he: צרו דף מקורות משלכם בעזרת בונה דפי המקורות של ספריא

source: Copy Sheet
es: 复制表格

source: Embed Sheet
es: 嵌入表格

source: Tags
es: 标签

source: Assignments
es: 作业

source: Print
es: 打印

source: Visualize
es: 可视化

source: Highlight Mode
es: 高亮模式

source: Exit Highlight Mode
es: 退出高亮模式

source: Format
es: 格式

source: Number Sources
es: 编号来源

source: Box Sources
es: 框来源

source: Reset Source Text
es: 重置源文本

source: Auto-Segment Text
es: 自动分段文本

source: Remove Vowel Points
es: 移除元音标记

source: Add Source Title
es: 添加来源标题

source: Sheet Language
es: 表格语言

source: Tibetan
es: 藏语

source: Sheet Layout
es: 表格布局

source: Stacked
es: 堆叠

source: Side-by-Side
es: 并排

source: Side-by-Side Layout
es: 并排布局

source: Tibetan Left
es: 藏文左侧

source: Tibetan Right
es: 藏文右侧

source: Source Language
es: 来源语言

source: Source Layout
es: 来源布局

source: Reset to Sheet Default
es: 重置为表格默认设置

source: Insert
es: 插入

source: Source
es: 来源

source: Comment
es: 评论

source: Media
es: 媒体

source: Highlight Tools
es: 高亮工具

source: Paragraph View
es: 段落视图

source: Line-by-line View
es: 逐行视图

source: Reset
es: 重置

source: Filter
es: 筛选

source: Last Saved
es: 最后保存

source: All changes saved in Pecha
es: 所有更改已保存在Pecha中

source: Saving...
es: 保存中...

source: Changes Pending...
es: 更改待处理...

source: Highlight Mode is On
es: 高亮模式已开启

source: Share
es: 分享

source: View in Library
es: 在图书馆查看

source: Like this?
es: 喜欢这个？

source: create an account
es: 创建一个账户

source: to build your own source sheet.
es: 以创建你自己的来源表。

source: Header Title
es: 标题

source: More info
es: 更多信息

source: Edit
es: 编辑
he: עריכה

source: Created
es: 创建于

source: View
es: 查看
he: צפייה

source: Views
es: 查看次数

source: Based on
es: 基于

source: a sheet
es: 一个表格

source: by
es: 由

source: Assigned by
es: 分配者

source: Connection
es: 连接

source: Select a text
es: 选择文本

source: Browse Sources
es: 浏览来源

source: Select connected texts
es: 选择连接的文本

source: Add to Sheet
es: 添加到表格

source: Write or paste text
es: 编写或粘贴文本

source: Add Image, Youtube Video, SoundCloud link, or MP3
es: 添加图片、YouTube视频、SoundCloud链接或MP3

source: Paste URL
es: 粘贴URL
he: הדבק קישור

source: Upload an Image
es: 上传图片

source: Comment on this section
es: 对这个部分发表评论

source: Watch a 2 minute intro video or
es: 观看2分钟的介绍视频或

source: read more
es: 阅读更多

source: Source Sheet Builder: How it Works
es: 来源表生成器：如何工作

source: Add Sources
es: 添加来源

source: by typing a citation like:
es: 通过输入引用，例如：

source: Reorder Sources
es: 重新排序来源

source: by dragging and dropping.
es: 通过拖放。

source: your sheets to paper or PDF, or just
es: 将你的表格导出为纸质或PDF格式，或者只是

source: the link.
es: 链接。

source: More Options
es: 更多选项

source: are available in the icons that appear when you hover over a source.
es: 可以在悬停在来源上时出现的图标中找到。

source: Take a spin! But you'll need to
es: 试试吧！但你需要

source: login
es: 登录

source: to save your work.
es: 以保存你的工作。

source: Made with the Pecha Source Sheet Builder
es: 使用Pecha来源表生成器制作

source: Add Highlight
es: 添加高亮

source: Create New
es: 创建新表格
he: יצירת חדש

source: Source Sheet created on Pecha by
es: 在Pecha上创建的来源表，由

source: Based on
es: 基于

source: Assign this Sheet
es: 分配此表格

source: Stop Collecting Assignments
es: 停止收集作业

source: Saved Assignments
es: 保存的作业

source: Your student's saved assignments will be viewable here.
es: 你学生保存的作业将在此处查看。

source: Write a summary to help others understand your sheet...
es: 编写摘要以帮助其他人理解你的表格...
he: כתבו תקציר המסביר אודות דף המקורות שיצרתם...

source: Add Tags...
es: 添加标签...
he: הוספת תיוג

source: List on Pecha
es: 在Pecha上列出

source: Display Collection
es: 显示集合

source: None
es: 无
he: ללא

source: To manage the collections this sheet appears in, visit your profile.
es: 要管理此表单出现的集合，请访问您的个人资料。

source: Share a link
es: 分享链接

source: Anyone with access can
es: 任何有权限的人可以

source: Add a Parasha to a Source Sheet
es: 将经文添加到源表单

source: Change this source's layout
es: 更改此来源的布局

source: Reset to sheet defaults
es: 重置为表单默认设置

source: Would you like to make your Source Sheet public?
es: 您是否希望将您的源表单设为公开？

source: Make Public
es: 设为公开

source: Maybe Later
es: 稍后再说

source: Your Sheet is now Public!
es: 您的表单现在已公开！

source: No problem, this sheet is still not listed on Sefaria.
es: 没问题，此表单仍未列在Sefaria上。

source: You can make your sheet public in the future from the
es: 您可以在将来从中将您的表单设为公开

source: Visualized
es: 可视化
he: תצוגה גרפית

source: Sefaria Source Sheet Builder
es: Sefaria源表单构建器
he: בונה דפי המקורות בספריא

source: Back to Sheet
es: 返回表单

source: TBD
es: 待定

source: Sefaria App
es: Sefaria应用
he: אפליקציית ספריא

source: Download the free Sefaria App for iOS and Android.
es: 下载免费的Sefaria应用程序，适用于iOS和Android。
he: הורידו את האפליקציות החינמיות של ספריא לאייפון ולאנדרואיד

source: Sign up for our Newsletter
es: 注册我们的通讯
he: הירשמו לקבלת העלון שלנו

source: <i>Subscribing...</i>
es: <i>正在订阅...</i>
he: <i>מבצע רישום...</i>

source: Subscribed! Welcome to our list.
es: 已订阅！欢迎加入我们的名单。
he: רישום הסתיים. ברוך הבא לרשימת התפוצה של ספריא!

source: Please enter a valid email address.
es: 请输入有效的电子邮件地址。
he: כתובת הדוא״ל שהוזנה אינה תקינה.

source: Sefaria: a Living Library of Jewish Texts Online
es: Sefaria：在线犹太文本的活库
he: ספריא: ספרייה חיה של טקסטים יהודיים

source: Sefaria Newsletter, Social Media and More
es: Sefaria通讯、社交媒体等
he: העלון של ספריא, פעילות ברשתות חברתיות ועוד

source: Powered by Sefaria Contest
es: 由Sefaria竞赛提供支持
he: תחרות פיתוח תוכנה

source: Texts Contributed to Sefaria
es: 贡献给Sefaria的文本
he: טקסטים שהופיעו לראשונה בספריא

source: Learn the Talmud each day with Daf Yomi on Sefaria.
es: 通过Sefaria上的Daf Yomi每天学习塔木德。
he: לימוד יומי של התלמוד בספריא

source: Dicta Thanks
es: Dicta感谢
he: תודות לדיקטה

source: Sefaria thanks Dicta for all of their help.
es: Sefaria感谢Dicta的所有帮助。
he: ספריא מודה לארגון דיקטה על כל עזרתם

source: Texts Digitized by Sefaria
es: 由Sefaria数字化的文本
he: טקסטים שעברו דיגיטציה על ידי ספריא

source: Teach with Sefaria
es: 使用Sefaria进行教学

source: Donate to Sefaria
es: 捐赠给Sefaria
he: תרומות לספריא

source: Linker Plugin
es: Linker插件
he: מחולל קישורים לספריא

source: Download the free Sefaria Apps for iOS and Android.
es: 下载免费的Sefaria应用程序，适用于iOS和Android。
he: הורידו את האפליקציות החינמיות של ספריא לאייפון ולאנדרואיד

source: Sign up for Sefaria's Newsletter
es: 注册Sefaria的通讯
he: הרשמה לרשימת התפוצה של ספריא

source: Powered by Sefaria Contest 2020
es: 由Sefaria竞赛2020提供支持
he: תחרות פיתוח תוכנה 2020

source: Powered by Sefaria Contest 2021
es: 由Sefaria竞赛2021提供支持

source: Powered by Sefaria
es: 由Sefaria提供支持

source: Privacy Policy
es: 隐私政策
he: מדיניות פרטיות

source: Ramban on Torah - Thank you to our Sponsors
es: Ramban on Torah - 感谢我们的赞助商

source: Remote Learning | Sefaria
es: 远程学习 | Sefaria
he: למידה מרחוק בספריא

source: Resources for teaching and learning virtually.
es: 用于虚拟教学和学习的资源。
he: משאבים ללימוד ולמידה מרחוק באופן מקוון

source: About Sefaria Community Translations
es: 关于Sefaria社区翻译
he: אודות התרגומים הקהילתיים של ספריא

source: About Sefaria Editions
es: 关于Sefaria版本
he: אודות גרסאות ספריא

source: In Memory of Rabbi Shraga Silverstein
es: 纪念Rabbi Shraga Silverstein
he: לזכרו של הרב שרגא סילברשטיין

source: Sefaria Strategy
es: Sefaria战略
he: תכנון בספריא

source: Sefaria's Supporters
es: Sefaria的支持者
he: התומכים של ספריא

source: The Sefaria Team
es: Sefaria团队
he: הצוות של ספריא

source: Sefaria's team is working to create the Jewish future.
es: Sefaria的团队正在努力创造犹太人的未来。
he: הצוות של ספריא עובד קשה על יצירת עתיד לעולם הספר היהודי

source: Terms of Use
es: 使用条款
he: תנאי שימוש

source: Sefaria Testimonials
es: Sefaria的评价
he: המלצות על ספריא

source: Sefaria’s Impact – Reflections and Insights from Users
es: Sefaria的影响 - 用户的反思和见解
he: ההשפעה של ספריא- הרהורים ותובנות משתמשים

source: The Sefaria Story
es: Sefaria的故事
he: תולדות ספריא

source: Watch a video about the story of Sefaria.
es: 观看有关Sefaria故事的视频。
he: צפו בסרטון המתאר את קורות ספריא

source: Sefaria Torah Tab
es: Sefaria Torah选项卡
he: לשונית לימוד בספריא

source: Install the free Sefaria Torah Tab for your web browser.
es: 为您的网络浏览器安装免费的Sefaria Torah选项卡。
he: התקינו את תוסף ספריא ללשונית לימוד

source: Visualizations
es: 可视化
he: תרשימים גרפיים

source: The William Davidson Talmud
es: William Davidson塔木德
he: התלמוד במהדורת וויליאם דוידסון

source: Word by Word: A Jewish Women's Writing Circle
es: 逐字逐句：犹太女性写作圈

source: Student-Teacher Relationships in the Talmud
es: 塔木德中的师生关系
he: קשרי מורה-תלמיד בתלמוד

source: Timeline
es: 时间轴
he: קו זמן

source: Unique Words used by Biblical Commentators
es: 圣经评论者使用的独特词汇
he: מילים יחידאיות בשימוש מפרשי מקרא

source: Explore how unique and verbose biblical commentators were.
es: 探索圣经评论者有多么独特和冗长。
he: צפו בייחוד הלשוני של מפרשי המקרא

source: Visualizing the Sefaria Library
es: 可视化Sefaria图书馆
he: ארון הספרים של ספריא במיצג גרפי

source: Visualizing the Parshiot
es: 可视化Parshiot
he: מיצג גרפי לפרשת השבוע

source: Visualizing Torah Connections through Rashi's Commentary
es: 通过拉希的评论可视化托拉连接
he: מיצג קשרים בתוך התורה דרך ציטוטים ברשי

source: Sefaria
he: ספריא

source: | Sefaria
he: | ספריא

source: Texts & Source Sheets from Torah, Talmud and Sefaria's library of Jewish sources.
he: טקסטים ודפי מקורות מן התורה, התלמוד וספריית המקורות של ספריא.

source: Jewish texts and source sheets about %(topic)s from Torah, Talmud and other sources in Sefaria's library.
he: טקסטים יהודיים ודפי מקורות על %(topic)s מן התורה, התלמוד ומקורות אחרים במאגר ספריא.

source: Explore Jewish texts related to traditional and contemporary topics, coming from Torah, Talmud, and more.
he: גלו מקורות יהודיים הקשורים לסוגיות עכשוויות ולנושאים מסורתיים – בתורה, בתלמוד ובשלל חיבורים נוספים.

source: The largest free library of Jewish texts available to read online in Hebrew and English including Torah, Tanakh, Talmud, Mishnah, Midrash, commentaries and more.
he: מאגר הגדול ביותר של מקורות יהודיים ללא תשלום בו ניתן לעיין בצורה מקוונת במגוון מקורות החל מהתורה והמקרא, דרך המשנה והתלמוד, עולם המדרש, פרשנים ועוד.

source: Weekly Torah portions, Daf Yomi, and other schedules for Torah learning.
he: פרשת השבוע, הדף היומי ומחזורי לימוד תורה נוספים.

source: New Additions to the Sefaria Library
he: חידושים בארון הספרים של ספריא

source: See texts, translations and connections that have been recently added to Sefaria.
he: הודעות לגבי טקסטים, תרגומים וקישורים חדשים שנוספו לאחרונה לספריא

source: %(full_name)s is on Sefaria. Follow to view their public source sheets, notes and translations.
he: %(full_name)s נמצא בספריא. עקבו אחרי הפעילות שלהם בדפי מקורות, הערות ותרגומים

source: New and featured source sheets, divrei torah, articles, sermons and more created by members of the Sefaria community.
he: דפי מקורות חדשים ומומלצים, דברי תורה, מאמרים, דרשות ועוד הרבה חומרים מעניינים שיצרו חברי קהילת ספריא.

source: I am an educator
he: אני מחנך/ מחנכת

source: A public collection with this name already exists. Please choose a different name before publishing.
he: כבר קיימת אסופה ציבורית בשם זה. יש לבחור שם אחר לאסופה כדי לפרסמה.

source: Public Collections are required to include a collection image (a square image will work best).
he: כדי לפרסם אסופה ציבורית, יש להגדיר עבורה תמונת קבוצה (תמונה ריבועית עדיפה).

source: Leaving this collection would leave it without any owners. Please appoint another owner before leaving, or delete the collection.
he: עזיבת האסופה תותיר אותה ללא מנהל. עליך למנות מנהל אחר לפני עזיבת האסופה או לחלופין למחוק אותה.

source: View a user's acitvitiy history on Sefaria, including published source sheets, and text translations, edits or additions.
he: צפו בפעילות של משתמש בספריא, כולל דפי מקורות, תרגומים ועריכות

source: View the complete log of public activity on Sefaria, including published source sheets, and text translations, edits or additions.
he: צפו ברישום הכולל של פעילות פומבית בספריא כולל דפי מקורות, תרגומים ועריכות

source: You're receiving this message because you have an account on
he: הינך מקבל הודעה זו מאחר ויש לך חשבון משתמש ב-

source: To change your email settings, click <a href="%(settings_url)s">here</a>
he: לשינוי פרטי כתובת המייל שלך, לחץ <a href="%(settings_url)s">כאן</a>

source: Your feedback is welcome. Feel free to send us an <a href="%(hello_email)s">email</a>.
he: דעתכם חשובה לנו. <a href="%(hello_email)s">ספרו</a>. לנו מה אתם חושבים!

source: %(inviter)s invited you to contribute to the collection %(collection)s on Sefaria.
he: קיבלת הזמנה מ%(inviter)s לשותפות באסופה %(collection)s באתר ספריא.

source: To accept this invitation, <a href="%(register)s">create a free Sefaria account</a>.
he: לקבלת ההזמנה יש<a href="%(register)s">ליצור חשבון משתמש באתר ספריא ללא תשלום.</a>.

source: Sefaria is a free living library of Jewish texts. Collections on Sefaria help you easily build and share collections of source sheets you create or find on Sefaria.<br>. Feel free to send any questions over <a href="mailto:hello@sefaria.org">email</a>.
he: ספריא היא ספרייה חיה של מקורות יהודיים. "האסופות של ספריא" מאפשרות לך להכין בקלות אסופות של דפי מקורות שיצרת או שאחרים יצרו, ולשתף אותן.<br> בכל שאלה אפשר בשמחה לשלוח אלינו <a href="mailto:hello@sefaria.org">דוא"ל</a>.

source: Link Explorer - Visualized Connections Between Talmud and Tanakh | Sefaria
he: סייר חיבורים - מיצג גרפי של הקשרים בין המקרא לתלמוד | ספריא

source: Link Explorer - Visualized Connections Between %(bottomCatTitle)s and %(topCatTitle)s | Sefaria
he: סייר חיבורים - מיצג גרפי של הקשרים בין %(bottomCatTitle)s ו%(topCatTitle)s | ספריא

source: Explore over 30,000 examples of the Talmud quoting a verse from Tanakh. Zoom in to particular books either above or below to explore deeper.
he: צפו בלמעלה מ30 אלף דוגמאות בהן התלמוד מצטט פסוקים מן המקרא. ניתן גם להתקרב ולצפות בקשרים המתייחסים לספר אחד או מסכת מסויימת.

source: Visually explore quotations and connections between %(bottomCatTitle)s and %(topCatTitle)s. Zoom in to particular books either above or below to explore deeper.
he: סיירו חזותית וגלו ציטוטים וקישורים בין %(bottomCatTitle)s ו%(topCatTitle)s. ניתן גם להתקרב ולצפות בקשרים המתייחסים לספר אחד או מסכת מסויימת.

source: See who has been contributing most to Sefaria in terms of texts, translations, and source sheet.
he: רשימה של משתמשים שתרמו את הכמות הגדולה ביותר של טקסטים, תרגומים או דפי מקורות

source: See graphs charting Sefaria's progress since 2013 across metrics including word counts, number of links and number of source sheets.
he: צפו במספר גרפים המתעדים את מהלך ההתקדמות של ספריא מאז 2013 על פני שלל מדדים כגון מספר מילים, מספר קישורים ומספר דפי מקורות

source: Biographies and information about the authors of Jewish texts on Sefaria, together with links to their available texts.
he: ביוגרפיות ומידע אודות החכמים ואישים בתולדות ספרות ישראל המצויים באוצר של ספריא, עם קישורים לטקסטים שלהם במאגר.

source: is on Sefaria. Follow to view their public source sheets, notes and translations.
he: נמצא בספריא. עקבו אחרי פעילות שלהם בדפי מקורות, הערות ותרגומים

source: Log in to Sefaria
he: כניסה לחשבון בספריא

source: Log in to your Sefaria account to make source sheets, write notes, and follow other Sefaria users.
he: כניסה לחשבונכם בספריא כדי להיעזר בבונה דפי המקורות, לרשום הערות פרטיות על מקורות וכדי להיות בקשר עם משתמשים אחרים

source: A request has been made to reset the password for this email address on Sefaria.org.
he: בקשה התקבלה במערכת לאיפוס ססמת משתמש בעל כתובת מייל זו באתר sefaria.org.il

source: Sefaria.org Password Reset
he: איפוס סיסמא

source: Create an account on Sefaria to make source sheets, take notes and follow other people.
he: צרו חשבון בספריא בכדי להיעזר בבונה דפי המקורות, לרשום הערות פרטיות על מקורות וכדי להיות בקשר עם משתמשים אחרים

source: Explore how different categories of Mitzvot connect to one another through this parallel sets chart.
he: גרף המדגים כיצד קבוצות שונות של מצוות קשורות אחת לשניה

source: Assignment Completed by %(owner)s
he: מטלה בוצעה על ידי %(owner)s

source: Source Sheet by %(owner)s
he: דף מקורות מאת %(owner)s

source: Search for a Text or Commentator
he: הקלידו לחיפוש שם של טקסט או פרשן

source: Made with the Sefaria Source Sheet Builder
he: נבנה באמצעות בונה דפי המקורות בספריא

source: Add <span class="sourceName"></span> to a Source Sheet
he: הוספת <span class="sourceName"></span> לדף מקורות

source: Visual layout of a source sheet by %(sheet.owner|user_name)s created with Sefaria's Source Sheet Builder.
he: מצב עימוד גרפי של דף המקורות מאת %(sheet.owner|user_name)s. נוצר בעזרת בונה דפי המקורות של ספריא

source: Chavruta on Sefaria
he: חברותא בספריא

source: Get updates on new texts and features on Sefaria by signing up for our newsletter or following us on social media.
he: קבלו עדכונים על הנעשה בספריא על ידי הרשמות לעלון או מעקב אחרי ספריא באתרי מדיה חברתית

source: Texts on Sefaria that list this page as their source were contributed directly to Sefaria and have not yet been published elsewhere in print or on the web.
he: טקסטים המציינים עמוד זה כמקור הטקסט נתרמו ישירות לספריא ולא פורסמו לפני כן במקומות אחרים בדפוס או בצורה מקוונת

source: Daf Yomi | Sefaria
he: הדף היומי | ספריא

source: About Sefaria
he: אודות ספריא

source: Sefaria is a non-profit organization dedicated to building the future of Jewish learning in an open and participatory way.
he: ספריא היא עמותה ללא מטרות רווה השואפת לעיצוב עתיד הלימוד היהודי כך שיהא פתוח ושיתופי.

source: Support Sefaria by making a tax-deductible donation online or by check or wire transfer.
he: תמכו בספריא על ידי תרומה פטורה ממס בעזרת המחאה, העברה או תשלום מקוון

source: Sefaria iOS
he: ספריא לאייפון

source: Jobs at Sefaria
he: משרות בספריא

source: Job openings at Sefaria, a non-profit technology organization dedicated to building the Jewish future.
he: משרות פנויות בספריא, עמותה ללא מטרות רווח שמטרתה הבטחת העתיד הטכנולוגי של עולם הספר היהודי

source: Automatically turn citations on your website into links or dynamic popups with the full text from Sefaria.
he: הפכו הפניות למקורות באתר שלכם לקישוריות לספריא או לחלונות טקסט קופצים עם הטקסט עצמו מתוך המאגר של ספריא

source: Sefaria Mobile Apps
he: ספריא בנייד

source: Sefaria Community Translations are open, crowd-sourced translations of texts available in the Sefaria Library.
he: תרגומים קהילתיים בספריא הם תרגומי מקורות פתוחים וכתובים על ידי הציבור ומצויים במאגר לשימוש כללי

source: The Sefaria Edition is a Sefaria commissioned translation created by professional translators.
he: גרסאות ספריא הן גרסאות תרגום מיוחדות שהוזמנו במיוחד עבור ספריא ונוצרו על ידי מתרגמים מקצועיים

source: Sheets on Sefaria
he: דפי מקורות בספריא

source: Mix and match sources from Sefaria’s library of Jewish texts, and add your comments, images and videos.
he: בחרו לכם מקורות מארון הספרים היהודי של ספריא והוסיפו הערות, תמונות או סרטונים משלכם.

source: Sefaria gratefully acknowledges the following donors whose generosity and leadership are making Sefaria possible.
he: אנו מכירים תודה לתורמים הבאים, שבזכות נדיבותם והנהגתם ספריא ממשיכה לפעול

source: Projects which have been created to make interactive visualizations of the texts and connections in the Sefaria Library of Torah texts.
he: רשימה של פרוייקטים שונים שעשו שימוש בנתונים בספריא כדי ליצור תרשימים גרפיים ומצגות אודות מאגר הטקסטים והקישורים

source: The William Davidson Talmud is a free digital edition of the Babylonian Talmud with parallel translations, interlinked to major commentaries, biblical citations, Midrash, Halakhah, and an ever-growing library of Jewish texts.
he: התלמוד במהדורת וויליאם דוידסון הוא גרסה דיגיטלית חפשית של התלמוד הבבלי עם תרגום מקביל המקושר לפרשנים מרכזיים, אזכורים מקראיים, מדרש, הלכה ועולם הולך וגדל של טקסטים יהודיים

source: An index of the sages of the Talmud (Chazal) ordered by generation, including relationships to one another, time periods and links to learn more.
he: רשימת אישים בתלמוד לפי דור. כולל קשרים בין אישים, ציוני תקופות וקישורים לעיון נוסף.

source: How big is Torah compared to Talmud? This sunburst diagram lets you see the number of words in the texts and categories of Sefaria's library (which is growing every day!).
he: מה גודל המקרא לעומת התלמוד? דיאגרמת קרני השמש הזו מאפשרת לכם לראות את מספר המילים היחסי בכל טקסט וסוגה במאגר של ספריא

source: Explore how Rashi connects verses of Torah to one another when he quotes one verse in his commentary on another.
he: צפו כיצד רשי יוצר חיבורים בין מקומות שונים בתורה כשהוא מפרש פסוק אחד ומצטט שם פסוק אחר
