# -*- coding: utf-8 -*-

from typing import List, Iterable
import django
import spacy, csv
from spacy import Language
from sefaria.model import *
from sefaria.model.linker import ResolvedRef
from tqdm import tqdm
from sefaria.helper.linker import make_html

django.setup()

def parse_book(title: str, resolver: RefResolver) -> Iterable:
    input_text = []
    input_context_refs = []

    def collect_input(s: str, en_tref: str, he_tref: str, v: Version) -> None:
        nonlocal input_text, input_context_refs
        input_text += [s]
        input_context_refs += [Ref(en_tref)]

    version = VersionSet({"title": title, "language": "he"}).array()[0]
    version.walk_thru_contents(collect_input)
    resolved = resolver.bulk_resolve_refs('he', input_context_refs, input_text, with_failures=True, verbose=True)
    return resolved, input_text, input_context_refs


def save_resolved_refs(resolved, filename):
    total, num_resolved = 0, 0
    max_parts = 0
    rows = []
    for input_ref, resolved_for_seg in resolved:
        for resolved_raw_ref in resolved_for_seg:
            assert isinstance(resolved_raw_ref.raw_ref, RawRef)
            total += 1
            row = {
                "Input Ref": input_ref.normal(),
                "Found Citation": resolved_raw_ref.raw_ref.text,
            }
            if not resolved_raw_ref.is_ambiguous:
                if resolved_raw_ref.ref is not None:
                    num_resolved += 1
                    row['Found Ref'] = resolved_raw_ref.ref.normal()
                parts = resolved_raw_ref.raw_ref.raw_ref_parts
                if len(parts) > max_parts:
                    max_parts = len(parts)
                for i, p in enumerate(parts):
                    row[f"Part {i+1}"] = p.text
            rows += [row]
    with open(f'../data/{filename}', 'w') as fout:
        c = csv.DictWriter(fout, ['Input Ref', 'Found Citation', 'Found Ref'] + [f'Part {i+1}' for i in range(max_parts)])
        c.writeheader()
        c.writerows(rows)
    print(f"Percent Resolved: {num_resolved}/{total if total > 0 else 1} ({round(num_resolved/total*100, 2)}%)")


def parse_string(resolver):
    s = """סימן ב שנית ע"ד הנ"ל
א הגיעני מכתבו שנית. ע"ד התפילין שכתבן נער
גדול בקומה שלא נבדק אם הביא שתי שערות. וכבר השבתי לו באריכות להכשיר התפילין משום חזקה דרבא וכעת הודיעני מעלתו מ"ש גדול אחד בספרו בענין זה להוכיח דחזקה דרבא לא הוי חזקה כלל מדאורייתא רק מדרבנן הוי חזקה להחמיר. והוא מגמ' דרפ"ו דנדה (דמ"ח ע"א) דפריך שם הגמ' וליתני בא העליון כו' וחכ"א או חולצת או מתייבמת ואנא ידענא משום דא"א הוא ומשני אי לא תנא אע"פ שא"א ה"א רוב נשים תחתון אתי ברישא ומיעוט עליון אתי ברישא ור"מ לטעמיה דחייש למיעוטא כו' וה"מ בסתמא כו'. ואי נימא דחזקה דרבא היא חזקה גמורה מדאורייתא היאך הוה אמינא דר"מ לטעמיה דחייש למיעוטא הא בכה"ג הוי מיעוטא דמיעוטא דאף ר"מ לא חייש ליה כדאמרינן ביבמות (דקי"ט רע"ב) ובע"ז (דל"ד ע"ב). והאריך בזה. והנני להשיב למעלתו שהגדול הנ"ל לא דיבר נכונה ואין לדבריו שחר במחכ"ת. חדא דהא מצינו שם בגמ' (ר"ד מ"ט) דמוקי הגמ' התם בברייתא דר"ש לית ליה חזקה דרבא ע"ש. וא"כ הכא במתני' אי לא תנא אע"פ שא"א ה"א דטעמיה דר"מ הכא משום דחייש למיעוטא ואז הוה מוכח באמת דר"מ לית ליה חזקה דרבא. וכמו ר"ש דלית ליה חזקה דרבא. ושפיר הוצרך לשנות במשנתנו אע"פ שא"א כדי שלא נטעה במילתיה דר"מ (וממילא ה"א ג"כ בדברי חכמים דה"מ בסתמא כו'). ולפי האמת חזקה דרבא היא חזקה גמורה מדאורייתא והיאך עלה ע"ד החכם הנ"ל להקשות כזאת על משנתנו שהיה לה לסמוך על מימרא דרבא שהיה אמורא אחרון ודבריו תמוהין מאד. וכי בראיה בטילה כזו יבא לדחות מהלכה דברי התוס' והראשונים דס"ל דחזקה דרבא היא חזקה גמורה מדאורייתא כמו שהארכתי בתשובתי הראשונה. ומלבד זה הי' י"ל עוד ע"פ ד' המרדכי בחולין פ' הזרוע שביאר שם דהא דר"מ לא חייש למיעוטא דמיעוטא היינו דוקא בתרי עניני דומיא דגבינות בית אונייקי דבע"ז שם דרוב עגלים דעלמא אין נשחטים לע"ז ואיכא נמי שאר בהמות שאין נשחטין כלל לע"ז כו'. אבל אם היו נשחטין משאר בהמות לע"ז אפילו אחת מני אלף לא הוי אלא חד מיעוטא והיה ר"מ חייש ליה. וכעין זה כ' הריטב"א בחידושיו לע"ז שם ע"ש ולפ"ז ה"נ י"ל דשפיר הוה חייש ר"מ להך מיעוטא שמביאין סימן העליון עד שלא בא התחתון אף שיש ג"כ רוב שמביאין שערות בזמנן ומיעוט שאינן מביאין בזמנן מ"מ הך מיעוטא שיש שהביאו סימן העליון עד שלא בא התחתון לא חשיב בזה מיעוטא דמיעוטא לומר דר"מ לא חייש ליה ואין זה מתרי ענייני דומיא דגבינות בית אונייקי וכסברת המרדכי והריטב"א הנ"ל. (ומה שי"ל בדבריהם מכ"ד מבואר במ"א). ומיהו א"צ לזה כאן ואסתגר בקמייתא. ומ"ש מעלתו עוד בשם ס' הנ"ל להביא ראי' מהך דכל הנבדקות נבדקות ע"פ נשים כו' ובעינן שם נשים כשירות דוקא. ואי חזקה דרבא היא חזקה גמורה מדאורייתא ה"ל להאמין לכל הנשים דגלויי מילתא בעלמא הוא. וכמו בכתובות דכיון דרוב נשים בתולות נישאות מהימנינן למה שראה בקטנותו כו' עכ"ד. ודבריו תמוהין דהרי בכתובות שם אדרבה לא האמינו רק לגדול שמעיד מה שראה בקטנותו וגם אותו לא האמינו רק בצירוף עוד ע"א גדול עמו כדאיתא התם בהדיא. ולא האמינו לנשים שם. והיאך עלה בדעתו להקשות משם ולהוכיח מזה דחזקה דרבא אינה חזקה מדאורייתא (ועיקר ד"ז כבר ביארתי בתשובתי הראשונה באות ח' ע"ש). וכן שאר
הדברים שהעתיק לי מעלתו מס' הנ"ל הם תמוהים ותשובתם בצדם. וכשיעיין היטב בדברי תשובתי בזה מעצמו ימצא סתירה לכל דבריו של החכם הנ"ל. ופשוט שהעיקר כדברי התוס' וגדולי הראשונים הנ"ל דחזקה דרבא היא חזקה גמורה מדאורייתא וכמ"ש באריכות: ב ומה שהקשה מעלתו לפ"ד הרמב"ן והרשב"א בחולין שהבאתי דמשמע מדבריהם דהא דלא סמכינן על
חזקה דרבא לענין חליצה ובעי בדיקה היינו משום דאף במקום רובא כל היכא דאיכא לברורי מבררינן. דלפ"ז תיקשי ג"כ מגמ' דרפ"ו דנדה הנ"ל בהא דתני במתני' אע"פ שא"א כו', דמפרש הגמ' דאי לא תני הכי ה"א רוב נשים אתי תחתון ברישא כו' ורבנן לטעמייהו דלא חיישי למיעוטא וה"מ בסתמא כו'. דהיאך היה ה"א לומר כן הא א"כ תיקשי דלרבנן דר"מ נמי אף דלא חיישי למיעוטא מ"מ אכתי תהא צריכה בדיקה אם הביאה שערות כיון דכל כמה דאיכא לברורי מבררינן אפי' במקום רוב כנ"ל. פשוט הוא דלק"מ. דודאי י"ל דבמקום דאיכא תרי רובי או רובא וחזקה אז אפי' בדאיכא לברורי א"צ לברר כלל. והכא איכא תרתי, חזקה דרבא שהיא כמו רוב כנ"ל, ועוד רוב דמייתי דמייתי סימן תחתון ברישא כדאמר שם. וכ"כ האחרונים בריש יו"ד במ"ש שם בש"ע באין מכירין אותו אם הוא מוחזק לשחוט שלא יתעלף וגם אם הוא מומחה ויודע ה"ש דמותר לאכול משחיטתו מחמת הרוב כו' ומ"מ אם הוא לפנינו צריך לבודקו אם הוא יודע ה"ש אבל א"צ לשואלו אם נתעלף. וכתב שם בתב"ש דהטעם משום דאיכא בזה תרי רובי, חדא דרוב בנ"א אין שוחטין אא"כ הוחזקו כו' ועוד דרוב בנ"א אינם מתעלפים, וע"ש בשמ"ח. הרי מוכח דבמקום תרי רובי אפי' איכא לברורי לא מבררינן. וה"נ נימא בגמ' דנדה הנ"ל ולק"מ קושיית מעלתו. ובזה ניחא ג"כ לפ"ד הרשב"א שהביא הש"ך ביו"ד (סי' ק"י ס"ק ס"ו) דס"ל דאפי' במקום ס"ס צריך בדיקה היכא דיכולין לברר ע"י בדיקה, והש"ך הוכיח כדבריו מהגמ' ע"ש. ולכאורה קשה לדבריו מהא דאמרינן בנדה (דט"ו ע"ב) דאשה שיש לה וסת בעלה מחשב ימי וסתה ובא עליה, ומוכח שם דא"צ לשואלה כלל בספק ראתה ספק לא ראתה ואת"ל ראתה שמא טבלה כו'. והשתא למה לא יצטרך לשואלה כיון דאף במקום ס"ס אי איכא לברורי מבררינן. וכ"פ בהדיא בש"ע יו"ד ס"ס קפ"ד דאם שהתה אחר וסתה שיעור שתספור ותטבול בא עליה וא"צ לשאול אותה. וצ"ל משום דכאן מסייע חזקה לס"ס ובכה"ג א"צ לברר כלל. (דהכא איכא חזקת טהרה. דלמ"ד וסתות דרבנן מדאורייתא יש לאוקמי אחזקת טהרה. ואף את"ל דמ"מ כשהגיע זמן וסתה איתרע חזקת טהרה שלה מ"מ כיון שדרכה לטבול
זהו ג"כ הוי כמו חזקה). וכן מצאתי להדיא שכ"כ בתורת השלמים ר"ס קפ"ה ע"ש. וראיתי להנו"ב (מ"ק ביו"ד סי' נ"ז) שהקשה להרשב"א דס"ל דבס"ס נמי היכא דאיכא לברורי מבררינן דא"כ אמאי סמכינן על סתם כלים של נכרים אינן ב"י דהוא מטעם ס"ס אף דאפשר לברר ע"י קפילא וכמ"ש הרא"ש בפ"ב דע"ז דמשום ס"ס לא הטריחוהו להטעימו לקפילא. והרשב"א גופי' פסק כן דסומכין ע"ז דסתם כלים של נכרים אינן ב"י, ותירץ הנו"ב דכיון דאין אנו דנים על הכלי דאפי' ודאי אינו ב"י אסור לבשל בו לכתחלה רק אנו דנים על התבשיל והתבשיל יש לו חזקת היתר ולכן בצירוף חזקת היתר עם הס"ס א"צ לעמוד על הבירור בזה עכ"ד הנו"ב. ואף שיש לפקפק על דבריו במה דפשיטא ליה שהתבשיל יש לו חזקת היתר. די"ל דאיתרע חזקתו כשבישלו בכלי שהוא ספק ב"י. ובכעין זה נחלקו הט"ז והנקה"כ ביו"ד ר"ס ק"ה לענין ספק כבוש, דהט"ז ס"ל שם דיש לאוקמי ההיתר בחזקת כשרות, והנה"כ ושאר
"""
    context_refs = [Ref("Job 1")]
    resolved = resolver.bulk_resolve_refs('he', context_refs, [s], with_failures=True)
    make_html(resolved, "../data/toratchesed-018__output.html", 'he')
    save_resolved_refs(zip(context_refs, resolved), 'toratchesed-018__output.csv')


if __name__ == '__main__':
    resolver = library.get_ref_resolver()
    resolved, input_text, context_refs = parse_book("Divreirivot", resolver)
    save_resolved_refs(zip(context_refs, resolved), 'divreirivot.csv')
    make_html([resolved], [input_text], "../data/divreirivot.html", 'he')
    # parse_string(resolver)
